### 几个经常用到的快捷函数

### Lambda Functions

In [1]:
# Lambda Functions - lambda (arg1, arg2): 做什么事情，之后并返回结果
multiply = lambda x, y: x * y

# 等价于如下的定义:
def multiply(x, y):
    return x * y

# Can call both of the above like:
multiply(4, 7)

28

### map() - apply lambda function to a list

In [5]:
# example of using map() to apply lambda function to a list
numbers = [
              [34, 63, 88, 71, 29],
              [90, 78, 51, 27, 45],
              [63, 37, 85, 46, 22],
              [51, 22, 34, 11, 18]
           ]
mean = lambda num_list: sum(num_list)/len(num_list)
averages = list(map(mean, numbers))
# 等价于下面的函数
averages = list(map(lambda num_list: sum(num_list)/len(num_list), numbers))
print(averages)
# [57.0, 58.2, 50.6, 27.2]

[57.0, 58.2, 50.6, 27.2]

### filter() - apply lambda function to a list

In [6]:
# example of using filter() to apply lambda function to a list
cities = ["New York City", "Los Angeles", "Chicago", "Mountain View", "Denver", "Boston"]
is_short = lambda name: len(name) < 10
short_cities = list(filter(is_short, cities))
# 等价于如下函数
short_cities = list(filter(lambda name: len(name) < 10, cities))
print(short_cities)

['Chicago', 'Denver', 'Boston']

### Generators

In [5]:
def my_range(x):
    i = 0
    while i < x:
        yield i  #yield就是return返回一个值，并且记住这个返回的位置，下次迭代就从这个位置后开始
        i += 1
a = my_range(5)
print(a,type(a))# 生成器类型 ，对于迭代器，或者生成器，我们访问里面的内容的时候，使用for循环。或者把他转换成一个list去访问。
#通常你所使用的range(5)就是一个迭代器。

<generator object my_range at 0x0000014119798740> <class 'generator'>

In [4]:
range(5)

range(0, 5)

In [6]:
#访问里面的内容的时候，使用for循环
for x in my_range(5):
    print(x)

0
1
2
3
4

In [7]:
sq_list = [x**2 for x in range(10)]
sq_list

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [9]:
sq_iterator = (x**2 for x in range(10))#正常创建list的方法，把[]换成（）就可以得到一个生成器
sq_iterator

In [13]:
# example
# generator function 工作很像 the built-in function enumerate
lessons = ["Why Python Programming", "Data Types and Operators", "Control Flow", "Functions", "Scripting"]
def my_enumerate(iterable, start=0):
    i = start
    for element in iterable:
        yield i, element
        i = i + 1
for i, lesson in my_enumerate(lessons, 1):
    print("Lesson {}: {}".format(i, lesson))

Lesson 1: Why Python Programming
Lesson 2: Data Types and Operators
Lesson 3: Control Flow
Lesson 4: Functions
Lesson 5: Scripting

In [11]:

# example
# 如果terable 对象，但是它很大，不能一次性读入内存
#比如，处理很大的文件，如果能切片成一个块块来处理是很重要的。
# 实现一个生成器函数chunker,它可以处理一个可迭代对象，并每次yields 一个具体大小的size.
def chunker(iterable, size):
    for i in range(0, len(iterable), size):
        yield iterable[i:i + size]
for chunk in chunker(range(25), 4):
    print(list(chunk))

[0, 1, 2, 3]
[4, 5, 6, 7]
[8, 9, 10, 11]
[12, 13, 14, 15]
[16, 17, 18, 19]
[20, 21, 22, 23]
[24]

# Numpy

[Jupyter Notebook Viewer](https://nbviewer.jupyter.org/github/ageron/handson-ml/blob/master/tools_numpy.ipynb)

[Python Numpy Tutorial](http://cs231n.github.io/python-numpy-tutorial/#numpy)

In [35]:
import numpy as np

## Create ndarray

In [15]:
# Create a 1D ndarray that contains only integers
x = np.array([1, 2, 3, 4, 5])
print('x = ', x) # x = [1 2 3 4 5]
print('x has dimensions:', x.shape) # x has dimensions: (5,)
print('The elements in x are of type:', x.dtype) # The elements in x are of type: int64

# Create a rank 2 ndarray that only contains integers
Y = np.array([[1,2,3],[4,5,6],[7,8,9], [10,11,12]])
print('Y has dimensions:', Y.shape) # Y has dimensions: (4, 3)
print('Y has a total of', Y.size, 'elements') # Y has a total of 12 elements
print('Y is an object of type:', type(Y)) # Y is an object of type: class 'numpy.ndarray'
print('The elements in Y are of type:', Y.dtype) # The elements in Y are of type: int64

x =  [1 2 3 4 5]
x has dimensions: (5,)
The elements in x are of type: int32
Y has dimensions: (4, 3)
Y has a total of 12 elements
Y is an object of type: <class 'numpy.ndarray'>
The elements in Y are of type: int32

## Create ndarray with dtype

In [16]:
# Specify the dtype when creating the ndarray
x = np.array([1.5, 2.2, 3.7, 4.0, 5.9], dtype = np.int64)

## Save and load

In [17]:
# Save the array into a file
np.save('my_array', x)

# Load the saved array from current directory
y = np.load('my_array.npy')

## Zeros

In [18]:
# Create ndarray using built-in functions
# 3 x 4 ndarray full of zeros
# np.zeros(shape)
X = np.zeros((3,4))

## Ones

In [19]:
# a 3 x 2 ndarray full of ones
# np.ones(shape)
X = np.ones((3,2))

## Full

In [21]:
# 2 x 3 ndarray full of fives
# np.full(shape, constant value)
X = np.full((2,3), 5)
X

array([[5, 5, 5],
       [5, 5, 5]])

## Identity Matrix

In [22]:
# Identity Matrix
# Since all Identity Matrices are square, the np.eye() function only takes a single integer as an argument
# 5 x 5 Identity matrix
X = np.eye(5)
X

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

## Diagonal Matrix

In [23]:
# Diagonal Matrix
# 4 x 4 diagonal matrix that contains the numbers 10,20,30, and 50 on its main diagonal
X = np.diag([10,20,30,50])
X

array([[10,  0,  0,  0],
       [ 0, 20,  0,  0],
       [ 0,  0, 30,  0],
       [ 0,  0,  0, 50]])

## Arange

In [24]:
# Arange
# rank 1 ndarray that has sequential integers from 0 to 9
# x = [0 1 2 3 4 5 6 7 8 9]
x = np.arange(10)
print(x)
# rank 1 ndarray that has sequential integers from 4 to 9
# [start, stop)
# x = [4 5 6 7 8 9]
x = np.arange(4,10)
print(x)
# rank 1 ndarray that has evenly spaced integers from 1 to 13 in steps of 3.
# np.arange(start,stop,step)
# x = [ 1 4 7 10 13]
x = np.arange(1,14,3)
print(x)

[0 1 2 3 4 5 6 7 8 9]
[4 5 6 7 8 9]
[ 1  4  7 10 13]

## Linspace

In [27]:
# Linspace，更多请参考下面的链接
#https://blog.csdn.net/neweastsun/article/details/99676029
# linspace 返回 N 均匀分布的数 [start, stop]
# np.linspace(start, stop, N)
# x = [ 0. 2.77777778 5.55555556 8.33333333 11.11111111 13.88888889 16.66666667 19.44444444 22.22222222 25. ]
x = np.linspace(0,25,10)
x

array([ 0.        ,  2.77777778,  5.55555556,  8.33333333, 11.11111111,
       13.88888889, 16.66666667, 19.44444444, 22.22222222, 25.        ])

## Reshape

In [52]:
# Reshape
# np.reshape(ndarray, new_shape)
# converts the given ndarray into the specified new_shape
x = np.arange(20)
x = np.reshape(x, (4,5))
# or
x = np.arange(20).reshape(4, 5) # does the same thing as above
# and the same thing with with linshape
y = np.linspace(0,50,10, endpoint=False).reshape(5,2)
# One great feature about NumPy, is that some functions can also be
# applied as methods. This allows us to apply different functions in
# sequence in just one line of code

## Slicing

In [32]:
# Slicing
# ndarray[start:end]
# ndarray[start:]
# ndarray[:end]
# ndarray[<start>:<stop>:<step>]

# In methods one and three, the end index is excluded [,)
X = np.arange(20).reshape(4, 5)
print(X)
# select all the elements that are in the 2nd through 4th rows and in the 3rd to 5th columns
Z = X[1:4,2:5]
print(Z)
# 或者是
Z = X[1:,2:5]
print(Z)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]]
[[ 7  8  9]
 [12 13 14]
 [17 18 19]]
[[ 7  8  9]
 [12 13 14]
 [17 18 19]]

In [30]:
id(X),id(Z)#id()用来返回变量所指向的地址

(1379133221264, 1379133221648)

In [34]:
# select all the elements in the 3rd row
v = X[2,:] # v = [10 11 12 13 14]
print(v)
# select all the elements in the 3rd column
q = X[:,2] # q = [ 2 7 12 17]
print(q)
# select all the elements in the 3rd column but return a rank 2 ndarray
R = X[:,2:3]
print(R)

[10 11 12 13 14]
[ 2  7 12 17]
[[ 2]
 [ 7]
 [12]
 [17]]

In [36]:
X[0][0]=100
print(X)
print(Z)

[[100   1   2   3   4]
 [  5   6   7   8   9]
 [ 10  11  12  13  14]
 [ 15  16  17  18  19]]
[[ 7  8  9]
 [12 13 14]
 [17 18 19]]

In [38]:
M = X
print(id(M),id(X))#这里可以看到M和X指向同一个地址，也就是同一个值，对M修改，X一样也会修改，这种复制方式叫做浅拷贝

1379133221456 1379133221456

## Random

In [39]:
# Random，自行查看X的值，判断返回结果
# 3 x 3 ndarray with random floats in the half-open interval [0.0, 1.0).
# np.random.random(shape)
X = np.random.random((3,3))
# np.random.randint(start, stop, size = shape)
# [start, stop)
X = np.random.randint(4,15,size=(3,2))

# create ndarrays with random numbers that satisfy certain statistical properties
# 1000 x 1000 ndarray of random floats drawn from normal (Gaussian)
# distribution with a mean of zero and a standard deviation of 0.1.
# np.random.normal(mean, standard deviation, size=shape)
X = np.random.normal(0, 0.1, size=(1000,1000))

## Mutability值可变

In [42]:
# Mutability
# Change ndarray
print(x)
print("----------")
x[3] = 25
print(x)
print("----------")
print(X)
print("----------")
X[0,0] = 25
print(X)

[ 0.          2.77777778  5.55555556 20.         11.11111111 13.88888889
 16.66666667 19.44444444 22.22222222 25.        ]
----------
[ 0.          2.77777778  5.55555556 25.         11.11111111 13.88888889
 16.66666667 19.44444444 22.22222222 25.        ]
----------
[[ 2.00000000e+01 -2.64689686e-02 -1.06724566e-01 ... -6.56120262e-02
  -5.41880381e-02 -4.51899329e-02]
 [ 7.11524048e-02  4.95431345e-02 -1.25210945e-01 ...  2.05463987e-02
  -3.12127087e-02  8.31381839e-02]
 [-3.81464392e-02 -5.48651601e-02  3.23443599e-02 ...  9.17308954e-02
  -9.06472966e-02 -1.72630939e-02]
 ...
 [ 2.02417951e-03  1.89831560e-02  8.83146472e-02 ...  1.09429144e-02
   3.50269078e-02  7.06061396e-02]
 [ 9.57286967e-02 -1.11861506e-01 -3.21770380e-02 ... -4.46180972e-02
   4.53893155e-02 -9.54520220e-02]
 [ 1.46229679e-01  1.64050945e-01  1.10850330e-01 ... -9.61414908e-02
  -5.78858541e-02 -5.93936893e-03]]
----------
[[ 2.50000000e+01 -2.64689686e-02 -1.06724566e-01 ... -6.56120262e-02
  -5.41880381e-02 -4.51899329e-02]
 [ 7.11524048e-02  4.95431345e-02 -1.25210945e-01 ...  2.05463987e-02
  -3.12127087e-02  8.31381839e-02]
 [-3.81464392e-02 -5.48651601e-02  3.23443599e-02 ...  9.17308954e-02
  -9.06472966e-02 -1.72630939e-02]
 ...
 [ 2.02417951e-03  1.89831560e-02  8.83146472e-02 ...  1.09429144e-02
   3.50269078e-02  7.06061396e-02]
 [ 9.57286967e-02 -1.11861506e-01 -3.21770380e-02 ... -4.46180972e-02
   4.53893155e-02 -9.54520220e-02]
 [ 1.46229679e-01  1.64050945e-01  1.10850330e-01 ... -9.61414908e-02
  -5.78858541e-02 -5.93936893e-03]]

## Delete

In [43]:
# Delete
# np.delete(ndarray, elements, axis)
x = np.array([1, 2, 3, 4, 5])
# delete the first and fifth element of x
x = np.delete(x, [0,4])

Y = np.array([[1,2,3],[4,5,6],[7,8,9]])
# delete the first row of Y
w = np.delete(Y, 0, axis=0)
# delete the first and last column of Y
v = np.delete(Y, [0,2], axis=1)

## Append

In [44]:
# Append
# np.append(ndarray, elements, axis)
# append the integer 6 to x
x = np.append(x, 6)
# append the integer 7 and 8 to x
x = np.append(x, [7,8])
# append a new row containing 7,8,9 to y
v = np.append(Y, [[10,11,12]], axis=0)
# append a new column containing 9 and 10 to y
q = np.append(Y,[[13],[14],[15]], axis=1)

## Insert

In [45]:
# Insert
# np.insert(ndarray, index, elements, axis)
# inserts the given list of elements to ndarray right before
# the given index along the specified axis
x = np.array([1, 2, 5, 6, 7])
Y = np.array([[1,2,3],[7,8,9]])
# insert the integer 3 and 4 between 2 and 5 in x. 
x = np.insert(x,2,[3,4])
# insert a row between the first and last row of Y
w = np.insert(Y,1,[4,5,6],axis=0)
# insert a column full of 5s between the first and second column of Y
v = np.insert(Y,1,5, axis=1)

## Stacking 矩阵拼接

In [46]:
# Stacking
# NumPy also allows us to stack ndarrays on top of each other,
# or to stack them side by side. The stacking is done using either
# the np.vstack() function for vertical stacking, or the np.hstack()
# function for horizontal stacking. It is important to note that in
# order to stack ndarrays, the shape of the ndarrays must match.
x = np.array([1,2])
Y = np.array([[3,4],[5,6]])
z = np.vstack((x,Y)) # [[1,2], [3,4], [5,6]]
w = np.hstack((Y,x.reshape(2,1))) # [[3,4,1], [5,6,2]]

## Copy

In [47]:
# Copy

Z = np.copy(X[1:4,2:5])#深度拷贝
#  create a copy of the slice using the copy as a method
W = X[1:4,2:5].copy()

## Extract elements along the diagonal

In [49]:
T = np.arange(9).reshape((3,3))
# Extract elements along the diagonal
d0 = np.diag(T)
print(d0)
# As default is k=0, which refers to the main diagonal.
# Values of k > 0 are used to select elements in diagonals above
# the main diagonal, and values of k < 0 are used to select elements
# in diagonals below the main diagonal.
d1 = np.diag(T, k=1)
d2 = np.diag(T, k=-1)
print(d1)
print(d2)

[0 4 8]
[1 5]
[3 7]

## Find Unique Elements

In [50]:
# Find Unique Elements in ndarray
u = np.unique(X)
u

array([-0.48656216, -0.46703948, -0.44818485, ...,  0.48432804,
        0.48912767, 25.        ])

## Boolean Indexing 布尔索引

In [63]:
# Boolean Indexing
X = np.arange(25).reshape(5, 5)
print('The elements in X that are greater than 10:', X[X > 10])
print('The elements in X that less than or equal to 7:', X[X <= 7])
print('The elements in X that are between 10 and 17:', X[(X > 10) & (X < 17)])

# use Boolean indexing to assign the elements that
# are between 10 and 17 the value of -1
X[(X > 10) & (X < 17)] = -1

The elements in X that are greater than 10: [11 12 13 14 15 16 17 18 19 20 21 22 23 24]
The elements in X that less than or equal to 7: [0 1 2 3 4 5 6 7]
The elements in X that are between 10 and 17: [11 12 13 14 15 16]

## Set Operations

In [64]:
# Set Operations
x = np.array([1,2,3,4,5])
y = np.array([6,7,2,8,4])
print('The elements that are both in x and y:', np.intersect1d(x,y))
print('The elements that are in x that are not in y:', np.setdiff1d(x,y))
print('All the elements of x and y:',np.union1d(x,y))

The elements that are both in x and y: [2 4]
The elements that are in x that are not in y: [1 3 5]
All the elements of x and y: [1 2 3 4 5 6 7 8]

## Sorting

In [65]:
# Sorting
# When used as a function, it doesn't change the original ndarray
s = np.sort(x)
# When used as a method, the original array will be sorted
x.sort()

# sort x but only keep the unique elements in x
s = np.sort(np.unique(x))

# sort the columns of X
s = np.sort(X, axis = 0)

# sort the rows of X
s = np.sort(X, axis = 1)

## Math Functions

In [66]:
# NumPy allows element-wise operations on ndarrays as well as
# matrix operations. In order to do element-wise operations,
# NumPy sometimes uses something called Broadcasting.
# Broadcasting is the term used to describe how NumPy handles
# element-wise arithmetic operations with ndarrays of different shapes.
# For example, broadcasting is used implicitly when doing arithmetic
# operations between scalars and ndarrays.
x = np.array([1,2,3,4])
y = np.array([5.5,6.5,7.5,8.5])
np.add(x,y)
np.subtract(x,y)
np.multiply(x,y)
np.divide(x,y)

# in order to do these operations the shapes of the ndarrays
# being operated on, must have the same shape or be broadcastable
X = np.array([1,2,3,4]).reshape(2,2)
Y = np.array([5.5,6.5,7.5,8.5]).reshape(2,2)
np.add(X,Y)
np.subtract(X,Y)
np.multiply(X,Y)
np.divide(X,Y)

# apply mathematical functions to all elements of an ndarray at once
np.exp(x)
np.sqrt(x)
np.power(x,2)

array([ 1,  4,  9, 16])

## Statistical Functions

In [67]:
# Statistical Functions
print('Average of all elements in X:', X.mean())
print('Average of all elements in the columns of X:', X.mean(axis=0))
print('Average of all elements in the rows of X:', X.mean(axis=1))
print()
print('Sum of all elements in X:', X.sum())
print('Standard Deviation of all elements in X:', X.std())
print('Median of all elements in X:', np.median(X))
print('Maximum value of all elements in X:', X.max())
print('Minimum value of all elements in X:', X.min())

Average of all elements in X: 2.5
Average of all elements in the columns of X: [2. 3.]
Average of all elements in the rows of X: [1.5 3.5]

Sum of all elements in X: 10
Standard Deviation of all elements in X: 1.118033988749895
Median of all elements in X: 2.5
Maximum value of all elements in X: 4
Minimum value of all elements in X: 1

## Broadcasting

In [54]:
# Broadcasting
# NumPy is working behind the scenes to broadcast 3 along the ndarray
# so that they have the same shape. This allows us to add 3 to each
# element of X with just one line of code.
print(4*X)
print(4+X)
print(4-X)
print(4/X)
# NumPy is able to add 1 x 3 and 3 x 1 ndarrays to 3 x 3 ndarrays
# by broadcasting the smaller ndarrays along the big ndarray so that
# they have compatible shapes. In general, NumPy can do this provided
# that the smaller ndarray can be expanded to the shape of the larger
# ndarray in such a way that the resulting broadcast is unambiguous.
x = np.array([1,2,3])
Y = np.array([[1,2,3],[4,5,6],[7,8,9]])
Z = np.array([1,2,3]).reshape(3,1)
print(x + Y)
print(Z + Y)

[[ 1.00000000e+02 -1.05875874e-01 -4.26898264e-01 ... -2.62448105e-01
  -2.16752152e-01 -1.80759731e-01]
 [ 2.84609619e-01  1.98172538e-01 -5.00843780e-01 ...  8.21855950e-02
  -1.24850835e-01  3.32552736e-01]
 [-1.52585757e-01 -2.19460640e-01  1.29377439e-01 ...  3.66923582e-01
  -3.62589186e-01 -6.90523756e-02]
 ...
 [ 8.09671803e-03  7.59326240e-02  3.53258589e-01 ...  4.37716574e-02
   1.40107631e-01  2.82424558e-01]
 [ 3.82914787e-01 -4.47446024e-01 -1.28708152e-01 ... -1.78472389e-01
   1.81557262e-01 -3.81808088e-01]
 [ 5.84918717e-01  6.56203778e-01  4.43401319e-01 ... -3.84565963e-01
  -2.31543417e-01 -2.37574757e-02]]
[[29.          3.97353103  3.89327543 ...  3.93438797  3.94581196
   3.95481007]
 [ 4.0711524   4.04954313  3.87478905 ...  4.0205464   3.96878729
   4.08313818]
 [ 3.96185356  3.94513484  4.03234436 ...  4.0917309   3.9093527
   3.98273691]
 ...
 [ 4.00202418  4.01898316  4.08831465 ...  4.01094291  4.03502691
   4.07060614]
 [ 4.0957287   3.88813849  3.96782296 ...  3.9553819   4.04538932
   3.90454798]
 [ 4.14622968  4.16405094  4.11085033 ...  3.90385851  3.94211415
   3.99406063]]
[[-21.           4.02646897   4.10672457 ...   4.06561203   4.05418804
    4.04518993]
 [  3.9288476    3.95045687   4.12521095 ...   3.9794536    4.03121271
    3.91686182]
 [  4.03814644   4.05486516   3.96765564 ...   3.9082691    4.0906473
    4.01726309]
 ...
 [  3.99797582   3.98101684   3.91168535 ...   3.98905709   3.96497309
    3.92939386]
 [  3.9042713    4.11186151   4.03217704 ...   4.0446181    3.95461068
    4.09545202]
 [  3.85377032   3.83594906   3.88914967 ...   4.09614149   4.05788585
    4.00593937]]
[[ 1.60000000e-01 -1.51120358e+02 -3.74796558e+01 ... -6.09644333e+01
  -7.38170294e+01 -8.85152897e+01]
 [ 5.62173550e+01  8.07377256e+01 -3.19460890e+01 ...  1.94681319e+02
  -1.28152928e+02  4.81126699e+01]
 [-1.04859066e+02 -7.29060117e+01  1.23669166e+02 ...  4.36058100e+01
  -4.41270744e+01 -2.31708176e+02]
 ...
 [ 1.97610932e+03  2.10713118e+02  4.52926001e+01 ...  3.65533337e+02
   1.14197920e+02  5.66522971e+01]
 [ 4.17847536e+01 -3.57585030e+01 -1.24312250e+02 ... -8.96497218e+01
   8.81264668e+01 -4.19058698e+01]
 [ 2.73542281e+01  2.43826697e+01  3.60846919e+01 ... -4.16053461e+01
  -6.91015112e+01 -6.73472223e+02]]
[[ 2  4  6]
 [ 5  7  9]
 [ 8 10 12]]
[[ 2  3  4]
 [ 6  7  8]
 [10 11 12]]

# Pandas

In [3]:
import pandas as pd

## Series

series是一个1D的各种数据类型的数据类型，pandas series和numpy里面的Ndarray不同的有两个方法，第一个就是再pd里面，每个元素可以通过标签去索引，另外一个区别就是他的数据类型可以是多样的。

### Create Series

In [68]:
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])
#各种数据类型。

### shape, size, values, index, ndim

In [69]:
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements
The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

### check whether an index label exists in Series

In [70]:
# check whether an index label exists in Series
x = 'bananas' in groceries
x

False

### Accessing Elements

In [71]:
# Accessing Elements
# using index labels:
# single index label
print('How many eggs do we need to buy:', groceries['eggs'])
# access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
# use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 

# access elements in Groceries using numerical indices:
# use multiple numerical indices
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 1]]) 
# use a negative numerical index
print('Do we need bread:\n', groceries[[-1]]) 
# use a single numerical index
print('How many eggs do we need to buy:', groceries[0]) 
# use iloc (stands for integer location) to access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])
# Since we can access elements in various ways, in order to remove
# any ambiguity to whether we are referring to an index label
# or numerical index, Pandas Series have two attributes,
# .loc and .iloc to explicitly state what we mean. The attribute
# .loc stands for location and it is used to explicitly state that
# we are using a labeled index. Similarly, the attribute .iloc stands
# for integer location and it is used to explicitly state that we are
# using a numerical index.

How many eggs do we need to buy: 30
Do we need milk and bread:
 milk     Yes
bread     No
dtype: object
How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object
How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object
Do we need bread:
 bread    No
dtype: object
How many eggs do we need to buy: 30
Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

### Change Elements

In [72]:
# Change Elements
groceries['eggs'] = 2

### Delete Elements

In [73]:
# Delete Elements
# doesn't change the original Series being modified
groceries.drop('apples')
# delete items from Series in place by setting keyword inplace to True
groceries.drop('apples', inplace = True)
#print(groceries)

### Arithmetic Operations

In [74]:
# Arithmetic Operations
# we can perform element-wise arithmetic operations on Pandas Series
fruits = pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])
fruits + 2 # Adds 2 to all elements in the series
fruits - 2
fruits * 2
fruits / 2
# apply mathematical functions from NumPy to all elements of a Series
np.exp(fruits)
np.sqrt(fruits)
np.power(fruits,2)
# only apply arithmetic operations on selected items in Series
fruits['bananas'] + 2
fruits.iloc[0] - 2
fruits[['apples', 'oranges']] * 2
# you can apply arithmetic operations on a Series of mixed data
# type provided that the arithmetic operation is defined for all
# data types in the Series, otherwise you will get an error

apples     20
oranges    12
dtype: int64

## Dataframe
Pandas DataFrames 是一个2D数据结果，有标签的行和列。可以是多样的数据类型

### Axes

In [75]:
# understanding axes，思考错误的产生，如何解决
df.sum()       
# sums “down” the 0 axis (rows)
df.sum(axis=0) 
# equivalent (since axis=0 is the default)
df.sum(axis=1) 
# sums “across” the 1 axis (columns)

NameError: name 'df' is not defined

### Loading Data into DF

In [79]:
# Loading Data into DF
df = pd.read_csv('apple.csv')

# limit which rows are read when reading in a file
pd.read_csv('apple.csv', nrows=10)        
# only read first 10 rows

pd.read_csv('apple.csv', skiprows=[1, 2]) 
# skip the first two rows of data

# randomly sample a DataFrame
train = df.sample(frac=0.75) 
# will contain 75% of the rows

test = df[~df.index.isin(train.index)] 
# will contain the other 25%

# change the maximum number of rows and columns printed (‘None’ means unlimited)
pd.set_option('display.max_rows',6) 
# default is 60 rows

pd.set_option('display.max_columns', None) 
# default is 20 columns
print(df)
print("--------------------")
# reset options to defaults
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')

# change the options temporarily (settings are restored when you exit the ‘with’ block)
with pd.option_context('display.max_rows', 10, 'display.max_columns', None):
    print(df)

            date     close
0     1980-12-12    0.5134
1     1980-12-15    0.4866
2     1980-12-16    0.4509
...          ...       ...
9846  2020-01-02  300.3500
9847  2020-01-03  297.4300
9848  2020-01-06  299.8000

[9849 rows x 2 columns]
--------------------
            date     close
0     1980-12-12    0.5134
1     1980-12-15    0.4866
2     1980-12-16    0.4509
3     1980-12-17    0.4620
4     1980-12-18    0.4755
...          ...       ...
9844  2019-12-30  291.5200
9845  2019-12-31  293.6500
9846  2020-01-02  300.3500
9847  2020-01-03  297.4300
9848  2020-01-06  299.8000

[9849 rows x 2 columns]

### Create Dataframe

In [4]:
# Create a DataFrame manually from a dictionary of Pandas Series

# create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# print the type of items to see that it is a dictionary
print(type(items)) # class 'dict'

# create a Pandas DataFrame by passing it a dictionary of Series
shopping_carts = pd.DataFrame(items)

# create a DataFrame that only has a subset of the data/columns
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# create a DataFrame that only has selected keys
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# combine both of the above - selected keys for selected columns
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# create DataFrames from a dictionary of lists (arrays)
# In this case, however, all the lists (arrays) in the dictionary must be of the same length

# create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# create a DataFrame 
df = pd.DataFrame(data)

# create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# create DataFrames from a list of Python dictionaries
# create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# create a DataFrame 
store_items = pd.DataFrame(items2)

# create a DataFrame and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

<class 'dict'>
shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

### Create df from Series, dicts

In [81]:
# Create dictionary from a bunch of Series/data
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Create a dictionary with the data given above
a_dict = {'Author':authors,'Book Title':books,'User 1':user_1, 'User 2':user_2, 'User 3':user_3, 'User 4':user_4}

# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(a_dict)
book_ratings[:5]

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

In [82]:
# convert to numpy array (remove the column names, get just the values to convert it into a numpy array)
book_ratings_numpy = book_ratings.values
book_ratings_numpy

array([['Charles Dickens', 'Great Expectations', 3.2, 5.0, 2.0, 4.0],
       ['John Steinbeck', 'Of Mice and Men', nan, 1.3, 2.3, 3.5],
       ['William Shakespeare', 'Romeo and Juliet', 2.5, 4.0, nan, 4.0],
       [' H. G. Wells', 'The Time Machine', nan, 3.8, 4.0, 5.0],
       ['Lewis Carroll', 'Alice in Wonderland', nan, nan, nan, 4.2]],
      dtype=object)

In [87]:
#### create a DataFrame from a dictionary
pd.DataFrame({'column_x':['value_x1', 'value_x2', 'value_x3'], 'column_y':['value_y1', 'value_y2', 'value_y3']})

#### create a DataFrame from a list of lists
pd.DataFrame([['value_x1', 'value_y1'], ['value_x2', 'value_y2'], ['value_x3', 'value_y3']], columns=['column_x', 'column_y'])

   column_x  column_y
0  value_x1  value_y1
1  value_x2  value_y2
2  value_x3  value_y3

### Access Elements

In [5]:
# Access Elements
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])
# when accessing individual elements in a DataFrame, the labels
# should always be provided with the column label first,
# i.e. in the form dataframe[column][row]
# store_items for reference:
#          bikes	glasses	pants	watches
# store 1	    20	   NaN	   30	     35
# store 2	    15	  50.0	    5	     10

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

How many bikes are in Store 2: 15

### Modify Elements

In [6]:
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [7]:
# Modify Elements
# Add new column (adds it to the end of the df)
store_items['shirts'] = [15,2]

# New column via artihmetic operations b/w columns
store_items['suits'] = store_items['pants'] + store_items['shirts']

# Add new row

# To add rows to our df, create a new df then append it to the original df
# create a dictionary from a list of Python dictionaries
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)

# insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12660\2051490854.py:18: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  store_items = store_items.append(new_store)

In [8]:
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     2.0    7.0
store 3     20     30       35      4.0      0     NaN    NaN

### Delete Element

In [10]:
# Delete Element

# .pop() method only allows us to delete columns, while the .drop()
# method can be used to delete both rows and columns by use of the axis keyword

# remove the new watches column
#store_items.pop('watches')

# remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

# remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

In [11]:
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

### Rename the row and column labels

In [12]:
# Rename the row and column labels
# change the column label
store_items = store_items.rename(columns = {'bikes': 'hats'})
# change the row label
store_items = store_items.rename(index = {'store 3': 'last store'})

In [13]:
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

### Change index

In [14]:
# change the index to be one of the columns in the DataFrame
store_items = store_items.set_index('pants')

In [15]:
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

### Dealing with NaN values (missing data)

In [18]:
# Dealing with NaN values (missing data)

# create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])
print(store_items)
# check if we have any NaN values in our dataset
# .any() performs an or operation. If any of the values along the
# specified axis is True, this will return True.

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [20]:
df.isnull().any()

Integers    False
Floats      False
dtype: bool

In [22]:
# 计算NaN的个数count the number of NaN values in DataFrame
x =  store_items.isnull().sum().sum()
# count the number of non-NaN values in DataFrame
x = store_items.count()
x

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [23]:
# remove rows or columns from our DataFrame that contain any NaN values

# drop any rows with NaN values
store_items.dropna(axis = 0)

# drop any columns with NaN values
store_items.dropna(axis = 1)

# the original DataFrame is not modified by default
# to remove missing values from original df, use inplace = True
store_items.dropna(axis = 0, inplace = True)
print(store_items)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [24]:
#此cell是其他处理空值的方式，可以自己测试调试或者检索
# replace all NaN values with 0
store_items.fillna(0)

# forward filling: replace NaN values with previous values in the df,
# this is known as . When replacing NaN values with forward filling,
# we can use previous values taken from columns or rows.
# replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

# backward filling: replace the NaN values with the values that
# go after them in the DataFrame
# replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)
# replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

# the original DataFrame is not modified. replace the NaN values
# in place by setting inplace = True inside function
store_items.fillna(method = 'ffill', axis = 0, inplace = True)
store_items.interpolate(method = 'linear', axis = 0, inplace = True)

In [25]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

### head, tail, describe, max, memory_usage

In [29]:
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [31]:
print(df.head(2))
print("-------------")
print(df.tail())
print("-------------")
print(df.describe())
print("-------------")
# prints max value in each column
print(df.max())

# display the memory usage of a DataFrame
# total usage
print(df.info())
print("-------------")
# usage by column
df.memory_usage()

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
-------------
         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6
-------------
       Integers    Floats
count       3.0  3.000000
mean        2.0  7.433333
std         1.0  2.635021
min         1.0  4.500000
25%         1.5  6.350000
50%         2.0  8.200000
75%         2.5  8.900000
max         3.0  9.600000
-------------
Integers    3.0
Floats      9.6
dtype: float64
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, label 1 to label 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Integers  3 non-null      int64
 1   Floats    3 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 72.0+ bytes
None
-------------

Index       24
Integers    24
Floats      24
dtype: int64

### corr

In [32]:
# get the correlation between different columns
df.corr()

          Integers    Floats
Integers  1.000000  0.967734
Floats    0.967734  1.000000

### Groupby

In [44]:
df = pd.DataFrame({'key1':list('aacca'),
                    'key2':[1,2,3,2,2],
                    'data1':[2,4,7,5,3],
                    'data2':[1 for i in range(5)],
                    'data3':np.random.randn(5)
    
})
df

  key1  key2  data1  data2     data3
0    a     1      2      1  1.141028
1    a     2      4      1  0.192376
2    c     3      7      1  0.867907
3    c     2      5      1  0.219376
4    a     2      3      1  0.037798

In [49]:
# Groupby
gb = df['data1'].groupby(df['key1'])
gb_dic = list(gb)
gb_dic

[('a',
  0    2
  1    4
  4    3
  Name: data1, dtype: int64),
 ('c',
  2    7
  3    5
  Name: data1, dtype: int64)]

In [50]:
gb = df.groupby(df['key1'])['data1'].mean()
gb

key1
a    3.0
c    6.0
Name: data1, dtype: float64

In [51]:
gb = df.groupby(df['key1'])['data1'].sum()
gb

key1
a     9
c    12
Name: data1, dtype: int64

### Replace Values

In [53]:
# Replace Values
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s.map({'cat': 'kitten', 'dog': 'puppy'})

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

# 还可以这样

In [55]:
print(df)

  key1  key2  data1  data2     data3
0    a     1      2      1  1.141028
1    a     2      4      1  0.192376
2    c     3      7      1  0.867907
3    c     2      5      1  0.219376
4    a     2      3      1  0.037798

In [56]:
df['label'] = df['key1'].map({'a':'aa','c':'cc'})

In [57]:
print(df)

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
4    a     2      3      1  0.037798    aa

### Reading Files

In [94]:
# reading in a file from local computer or directly from a URL

# 各种格式下面的读取函数，详细使用，需要自己测试和查询文件
‘’’
Format Type     Data Description      Reader           Writer
text                  CSV            read_csv          to_csv
text                 JSON            read_json         to_json
text                 HTML            read_html         to_html
text             Local clipboard  read_clipboard     to_clipboard
binary             MS Excel          read_excel        to_excel
binary            HDF5 Format        read_hdf           to_hdf
binary           Feather Format     read_feather      to_feather
binary              Msgpack         read_msgpack      to_msgpack
binary               Stata           read_stata        to_stata
binary                SAS             read_sas 
binary        Python Pickle Format   read_pickle       to_pickle
SQL                   SQL             read_sql          to_sql
SQL             Google Big Query      read_gbq          to_gbq
‘’’

# 访问不同类型的文件，可以查询网站http://pandas.pydata.org/pandas-docs/version/0.20/io.html
df = pd.read_csv('local_path/file.csv’)
df = pd.read_csv('https://file_path/file.csv')

# when reading in tables, can specify separators, and note a column to be used as index separators can include tabs (“\t”), commas(“,”), pipes (“|”), etc.
df = pd.read_table('https://file_path/file', sep='|', index_col='column_x')

SyntaxError: invalid character in identifier (<ipython-input-94-412e7a98a1e7>, line 4)

### Summarizing小结，你会用了吗？

In [58]:
# examine the df data
df           
# print the first 30 and last 30 rows
type(df)     
# DataFrame
df.head()    
# print the first 5 rows
df.head(10)  
# print the first 10 rows
df.tail()    
# print the last 5 rows
df.index     
# “the index” (aka “the labels”)
df.columns   
# column names (which is “an index”)
df.dtypes    
# data types of each column
df.shape
# display only the number of rows
df.shape[0]
# number of rows and columns
df.values    
# underlying numpy array — df are stored as numpy arrays for effeciencies.

# summarize (describe) the DataFrame
# describe all numeric columns
df.describe()

# describe all object columns
df.describe(include=['object'])

# describe all columns
df.describe(include='all')

       key1      key2     data1  data2     data3 label
count     5  5.000000  5.000000    5.0  5.000000     5
unique    2       NaN       NaN    NaN       NaN     2
top       a       NaN       NaN    NaN       NaN    aa
freq      3       NaN       NaN    NaN       NaN     3
mean    NaN  2.000000  4.200000    1.0  0.491697   NaN
std     NaN  0.707107  1.923538    0.0  0.482944   NaN
min     NaN  1.000000  2.000000    1.0  0.037798   NaN
25%     NaN  2.000000  3.000000    1.0  0.192376   NaN
50%     NaN  2.000000  4.000000    1.0  0.219376   NaN
75%     NaN  2.000000  5.000000    1.0  0.867907   NaN
max     NaN  3.000000  7.000000    1.0  1.141028   NaN

### Working with Columns

In [61]:
# 选择一个列
df['key1']         
# select one column
type(df['key1'])   
# 还可以这样获得一个列信息
print(df.key1)

0    a
1    a
2    c
3    c
4    a
Name: key1, dtype: object

In [62]:
# summarize a Series/column
df.key1.describe()

count     5
unique    2
top       a
freq      3
Name: key1, dtype: object

In [63]:

# describe a single column
df.data2.mean()

1.0

In [66]:
# only calculate the mean
df['data2'].mean()    
# alternate method for calculating mean

1.0

In [67]:
# count the number of occurrences of each value
df.data2.value_counts()   
# most useful for categorical variables, but can also be used with numeric variables

1    5
Name: data2, dtype: int64

In [69]:
# filter df by one column, and print out values of another column
# when using numeric values, no quotations
df[df.key1 == 'a'].label

0    aa
1    aa
4    aa
Name: label, dtype: object

In [75]:
df

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
4    a     2      3      1  0.037798    aa

In [76]:
dfdf = df[df.data2 == 1 ].key1
print(list(dfdf))

['a', 'a', 'c', 'c', 'a']

In [77]:

# display the 3 most frequent occurances of column in ‘df’
df.key2.value_counts()[0:3]

2    3
1    1
3    1
Name: key2, dtype: int64

### Filtering and Sorting

In [81]:
df

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
4    a     2      3      1  0.037798    aa

In [82]:
# boolean filtering: only show df with column_z < 20
filter_bool = df.data1 < 4
filter_bool

0     True
1    False
2    False
3    False
4     True
Name: data1, dtype: bool

In [84]:
#create a Series of booleans…
df[filter_bool]

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
4    a     2      3      1  0.037798    aa

In [83]:
           
# …and use that Series to filter rows
df[filter_bool].describe()

           key2     data1  data2     data3
count  2.000000  2.000000    2.0  2.000000
mean   1.500000  2.500000    1.0  0.589413
std    0.707107  0.707107    0.0  0.780101
min    1.000000  2.000000    1.0  0.037798
25%    1.250000  2.250000    1.0  0.313606
50%    1.500000  2.500000    1.0  0.589413
75%    1.750000  2.750000    1.0  0.865220
max    2.000000  3.000000    1.0  1.141028

In [85]:
df

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
4    a     2      3      1  0.037798    aa

In [86]:
#    
# describes a data frame filtered by filter_bool
print(df[df.data1 < 3])       
print('------------')
# or, combine into a single step
print(df[df.data1 < 3].key1  )
print('------------')
# select one column from the filtered results
print(df[df['data1'] < 3].key1)
print('------------')
# alternate method 
print(df[df.data1 < 3].data2.value_counts() )
print('------------')
# value_counts of resulting Series, can also use .mean(), etc. instead of .value_counts()

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
------------
0    a
Name: key1, dtype: object
------------
0    a
Name: key1, dtype: object
------------
1    1
Name: data2, dtype: int64
------------

In [87]:

# boolean filtering with multiple conditions; indexes are in square brackets, conditions are in parens
df[(df.data1 < 3) & (df.key1=='a')]

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa

In [88]:

# ampersand for AND condition 
df[(df.data1 <3) | (df.data2 > 0)] 
# pipe for OR condition

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
4    a     2      3      1  0.037798    aa

In [89]:
# can also filter df using pandas.Series.isin 
df[df.key1.isin(['a', 'd'])]

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
4    a     2      3      1  0.037798    aa

In [90]:
# display a cross-tabulation of two Series
pd.crosstab(df.data1, df.data2)

data2  1
data1
2      1
3      1
4      1
5      1
7      1

In [91]:
# alternative syntax for boolean filtering (noted as “experimental” in the documentation)
df.query('data1 < 3')

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa

In [92]:
# df[df.column_z < 20]
df.query("data1 < 20 and key1 =='a'")  
# df[(df.column_z < 20) & (df.column_y==’string’)]

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
4    a     2      3      1  0.037798    aa

In [93]:
df.query('data1 < 3 or data2 > 0')        
# df[(df.column_z < 20) | (df.column_z > 60)]

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
1    a     2      4      1  0.192376    aa
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
4    a     2      3      1  0.037798    aa

### Sorting

In [96]:
         
# sort a column
df.sort_values('data1')

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
4    a     2      3      1  0.037798    aa
1    a     2      4      1  0.192376    aa
3    c     2      5      1  0.219376    cc
2    c     3      7      1  0.867907    cc

In [97]:
# sort a DataFrame by a single column
df.sort_values('data1', ascending=False)     
# use descending order instead

  key1  key2  data1  data2     data3 label
2    c     3      7      1  0.867907    cc
3    c     2      5      1  0.219376    cc
1    a     2      4      1  0.192376    aa
4    a     2      3      1  0.037798    aa
0    a     1      2      1  1.141028    aa

In [100]:
# Sort dataframe by multiple columns
df.sort_values(['key2','data1','data2'],ascending=[1,1,0])

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
4    a     2      3      1  0.037798    aa
1    a     2      4      1  0.192376    aa
3    c     2      5      1  0.219376    cc
2    c     3      7      1  0.867907    cc

### Selecting Multiple Columns and Filtering Rows

In [101]:
# select multiple columns
my_cols = ['key1', 'data1']  
# create a list of column names…
df[my_cols]

  key1  data1
0    a      2
4    a      3
1    a      4
3    c      5
2    c      7

In [105]:
#关于loc和iloc的用法，不懂得还可以参考网络
# use loc to select columns by name
df.loc[:, 'key1']    
# colon means “all rows”, then select one column
df.loc[:, ['key1','data1']]  
# select two columns
df.loc[:, 'key1':'data1']     
# select a range of columns (i.e., selects all columns including first through last specified)

# loc can also filter rows by “name” (the index)
df.loc[0, :]       
# row 0, all columns
df.loc[0:2, :]     
# rows 0/1/2, all columns
df.loc[0:2,'key1':'data1'] 
# rows 0/1/2, range of columns

# use iloc to filter rows and select columns by integer position
df.iloc[:, [0, 3]]     
# all rows, columns in position 0/3
df.iloc[:, 0:4]        
# all rows, columns in position 0/1/2/3
df.iloc[0:3, :]        
# rows in position 0/1/2, all columns

#filtering out and dropping rows based on condition (e.g., where column_x values are null)
drop_rows = df[df['key1'].isnull()]
new_df = df[~df.isin(drop_rows)].dropna(how='all')

### Renaming, Adding, and Removing Columns

In [106]:
df

  key1  key2  data1  data2     data3 label
0    a     1      2      1  1.141028    aa
4    a     2      3      1  0.037798    aa
1    a     2      4      1  0.192376    aa
3    c     2      5      1  0.219376    cc
2    c     3      7      1  0.867907    cc

In [110]:
# replace all column names (in place)
new_cols = ['key1_1','key2_1','data1_1','data2','data3','label']
df.columns = new_cols
df

  key1_1  key2_1  data1_1  data2     data3 label
0      a       1        2      1  1.141028    aa
4      a       2        3      1  0.037798    aa
1      a       2        4      1  0.192376    aa
3      c       2        5      1  0.219376    cc
2      c       3        7      1  0.867907    cc

In [112]:

# 读取文件的时候，给列取新的名字。
#df = pd.read_csv(‘df.csv’, header=0, names=new_cols)

# add a new column as a function of existing columns
df['new_column_1'] = df.data1_1 + df.key2_1
df

  key1_1  key2_1  data1_1  data2     data3 label  new_column_1
0      a       1        2      1  1.141028    aa             3
4      a       2        3      1  0.037798    aa             5
1      a       2        4      1  0.192376    aa             6
3      c       2        5      1  0.219376    cc             7
2      c       3        7      1  0.867907    cc            10

In [114]:
# removing columns
df.drop('new_column_1', axis=1)   
# 删除多个列可以使用下面的语句axis=0 for rows, 1 for columns — does not drop in place
#df.drop([‘column_x’, ‘column_y’], axis=1, inplace=True) 
# drop multiple columns

  key1_1  key2_1  data1_1  data2     data3 label
0      a       1        2      1  1.141028    aa
4      a       2        3      1  0.037798    aa
1      a       2        4      1  0.192376    aa
3      c       2        5      1  0.219376    cc
2      c       3        7      1  0.867907    cc

### Lower-case all DataFrame column names 把名字换成小写

In [115]:
df.columns

Index(['key1_1', 'key2_1', 'data1_1', 'data2', 'data3', 'label',
       'new_column_1'],
      dtype='object')

In [117]:
# 把列命换成小写
df.columns = map(str.lower, df.columns)
df.columns

Index(['key1_1', 'key2_1', 'data1_1', 'data2', 'data3', 'label',
       'new_column_1'],
      dtype='object')

In [119]:
# Even more fancy DataFrame column re-naming
# lower-case all DataFrame column names (for example)
df.rename(columns=lambda x: x.split('.')[-1], inplace=True)
df.columns

Index(['key1_1', 'key2_1', 'data1_1', 'data2', 'data3', 'label',
       'new_column_1'],
      dtype='object')

### Handling Missing Values

In [121]:
df

  key1_1  key2_1  data1_1  data2     data3 label  new_column_1
0      a       1        2      1  1.141028    aa             3
4      a       2        3      1  0.037798    aa             5
1      a       2        4      1  0.192376    aa             6
3      c       2        5      1  0.219376    cc             7
2      c       3        7      1  0.867907    cc            10

In [120]:
# missing values are usually excluded by default
df.data1_1.value_counts()             
# excludes missing values

2    1
3    1
4    1
5    1
7    1
Name: data1_1, dtype: int64

In [123]:
df.data1_1.value_counts(dropna=False) 
# includes missing values

2    1
3    1
4    1
5    1
7    1
Name: data1_1, dtype: int64

In [127]:
# find missing values in a Series
df.data1_1.isnull()  
# True if missing

0    False
4    False
1    False
3    False
2    False
Name: data1_1, dtype: bool

In [128]:
df.data1_1.notnull() 
# True if not missing

0    True
4    True
1    True
3    True
2    True
Name: data1_1, dtype: bool

In [129]:
# understanding axes
df.sum()       
# sums “down” the 0 axis (rows)

key1_1               aaacc
key2_1                  10
data1_1                 21
data2                    5
data3             2.458484
label           aaaaaacccc
new_column_1            31
dtype: object

In [130]:
df.sum(axis=0) 
# equivalent (since axis=0 is the default)

key1_1               aaacc
key2_1                  10
data1_1                 21
data2                    5
data3             2.458484
label           aaaaaacccc
new_column_1            31
dtype: object

In [131]:
df.sum(axis=1) 
# sums “across” the 1 axis (columns)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12660\3915835460.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

0     8.141028
4    11.037798
1    13.192376
3    15.219376
2    21.867907
dtype: float64

In [132]:
# adding booleans
pd.Series([True, False, True])       
# create a boolean Series

0     True
1    False
2     True
dtype: bool

In [133]:
pd.Series([True, False, True]).sum() 
# converts False to 0 and True to 1

2

In [136]:
# turn off the missing value filter,导入数据并用新的列命替代。
df = pd.read_csv('train.csv', header=0, names=new_cols, na_filter=False)
df.head(5)

,,,,,,key1_1,key2_1,data1_1,data2,data3,label
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,,S

In [139]:
# Clean up missing values in multiple DataFrame columns
df = df.fillna({
 'col1': 'missing',
 'col2': '99.999',
 'col3': '999',
 'col4': 'missing',
 'col5': 'missing',
 'col6': '99'
})

In [142]:
# Concatenate two DataFrame columns into a new, single column - (useful when dealing with composite keys, for example)
df['newcol'] = df['key1_1'].map(str) + df['key2_1'].map(str)
df.head(5)

,,,,,,key1_1,key2_1,data1_1,data2,data3,label,newcol
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S,10
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C,10
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S,00
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,10
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,,S,00

In [143]:

# In example below, swap in 0 for df[‘col1’] cells that contain null
df['new_col1'] = np.where(pd.isnull(df['key1_1']),0,df['key1_1']) + df['key2_1']
df.head(5)

,,,,,,key1_1,key2_1,data1_1,data2,data3,label,newcol,new_col1
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S,10,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C,10,1
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S,00,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,10,1
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,,S,00,0

### Handling Duplicated Values处理重复的值

In [144]:
# detecting duplicate rows
df.duplicated()

1    0  3  Braund, Mr. Owen Harris                              male    22    False
2    1  1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38    False
3    1  3  Heikkinen, Miss. Laina                               female  26    False
4    1  1  Futrelle, Mrs. Jacques Heath (Lily May Peel)         female  35    False
5    0  3  Allen, Mr. William Henry                             male    35    False
                                                                              ...
887  0  2  Montvila, Rev. Juozas                                male    27    False
888  1  1  Graham, Miss. Margaret Edith                         female  19    False
889  0  3  Johnston, Miss. Catherine Helen "Carrie"             female         True
890  1  1  Behr, Mr. Karl Howell                                male    26    False
891  0  3  Dooley, Mr. Patrick                                  male    32    False
Length: 891, dtype: bool

In [145]:
# True if a row is identical to a previous row
df.duplicated().sum()

141

In [148]:
# count of duplicates
df[df.duplicated()]

,,,,,,key1_1,key2_1,data1_1,data2,data3,label,newcol,new_col1
25,0,3,"Palsson, Miss. Torborg Danira",female,8,3,1,349909,21.0750,,S,31,4
72,0,3,"Goodwin, Miss. Lillian Amy",female,16,5,2,CA 2144,46.9000,,S,52,7
89,1,1,"Fortune, Miss. Mabel Helen",female,23,3,2,19950,263.0000,C23 C25 C27,S,32,5
118,0,2,"Turpin, Mr. William John Robert",male,29,1,0,11668,21.0000,,S,10,1
123,0,2,"Nasser, Mr. Nicholas",male,32.5,1,0,237736,30.0708,,C,10,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
870,1,3,"Johnson, Master. Harold Theodor",male,4,1,1,347742,11.1333,,S,11,2
872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47,1,1,11751,52.5542,D35,S,11,2
875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28,1,0,P/PP 3381,24.0000,,C,10,1
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25,0,1,230433,26.0000,,S,01,1
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,,1,2,W./C. 6607,23.4500,,S,12,3

In [149]:
# only show duplicates
df.drop_duplicates()

,,,,,,key1_1,key2_1,data1_1,data2,data3,label,newcol,new_col1
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S,10,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C,10,1
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S,00,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,10,1
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,,S,00,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.1250,,Q,05,5
887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,,S,00,0
888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S,00,0
890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C,00,0
891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,,Q,00,0

In [150]:
# check a single column for duplicates
df.duplicated(['key1_1', 'key2_1', 'data1_1']).sum()  
# specify columns for finding duplicates

154

In [152]:
# 某一列重复的人
df.key2_1.duplicated()

1    0  3  Braund, Mr. Owen Harris                              male    22    False
2    1  1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38     True
3    1  3  Heikkinen, Miss. Laina                               female  26     True
4    1  1  Futrelle, Mrs. Jacques Heath (Lily May Peel)         female  35     True
5    0  3  Allen, Mr. William Henry                             male    35     True
                                                                              ...
887  0  2  Montvila, Rev. Juozas                                male    27     True
888  1  1  Graham, Miss. Margaret Edith                         female  19     True
889  0  3  Johnston, Miss. Catherine Helen "Carrie"             female         True
890  1  1  Behr, Mr. Karl Howell                                male    26     True
891  0  3  Dooley, Mr. Patrick                                  male    32     True
Name: key2_1, Length: 891, dtype: bool

### Merging and Concatenating Dataframes

In [153]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3'],
                    'E': ['E0', 'E1', 'E2', 'E3']
                   })
df2 = pd.DataFrame({ 'A': ['A4', 'A5', 'A6', 'A7'],
                     'B': ['B4', 'B5', 'B6', 'B7'],
                     'C': ['C4', 'C5', 'C6', 'C7'],
                     'D': ['D4', 'D5', 'D6', 'D7'],
                     'F': ['F4', 'F5', 'F6', 'F7']
                   })

In [154]:
pd.concat([df1,df2])

    A   B   C   D    E    F
0  A0  B0  C0  D0   E0  NaN
1  A1  B1  C1  D1   E1  NaN
2  A2  B2  C2  D2   E2  NaN
3  A3  B3  C3  D3   E3  NaN
0  A4  B4  C4  D4  NaN   F4
1  A5  B5  C5  D5  NaN   F5
2  A6  B6  C6  D6  NaN   F6
3  A7  B7  C7  D7  NaN   F7

In [155]:
pd.concat([df1,df2], ignore_index=True)

    A   B   C   D    E    F
0  A0  B0  C0  D0   E0  NaN
1  A1  B1  C1  D1   E1  NaN
2  A2  B2  C2  D2   E2  NaN
3  A3  B3  C3  D3   E3  NaN
4  A4  B4  C4  D4  NaN   F4
5  A5  B5  C5  D5  NaN   F5
6  A6  B6  C6  D6  NaN   F6
7  A7  B7  C7  D7  NaN   F7

In [156]:
pd.concat([df1,df2], ignore_index=True, join="inner")

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [157]:
#添加一个新列
s1 = pd.Series(list(range(4)), name="F")
pd.concat([df1,s1], axis=1)

    A   B   C   D   E  F
0  A0  B0  C0  D0  E0  0
1  A1  B1  C1  D1  E1  1
2  A2  B2  C2  D2  E2  2
3  A3  B3  C3  D3  E3  3

In [159]:
#添加多个列
s2 = df1.apply(lambda x:x["A"]+"_GG", axis=1)
s2

0    A0_GG
1    A1_GG
2    A2_GG
3    A3_GG
dtype: object

In [160]:
s2.name="G"
pd.concat([df1,s1,s2], axis=1)

    A   B   C   D   E  F      G
0  A0  B0  C0  D0  E0  0  A0_GG
1  A1  B1  C1  D1  E1  1  A1_GG
2  A2  B2  C2  D2  E2  2  A2_GG
3  A3  B3  C3  D3  E3  3  A3_GG

# 关于merge的一些知识，可以自行检索测试了解

### Frequently Used Features

#### 使用map函数把指定列的值换成其他值

In [164]:
dict1 = {"a":[25,45,65,89],"b":(89,56,89,17),"c":[19,46,49,79]}
df = pd.DataFrame(dict1,index = ["第%d天"%i for i in range(1,5)])
df

      a   b   c
第1天  25  89  19
第2天  45  56  46
第3天  65  89  49
第4天  89  17  79

In [165]:
df['d'] = df.a.map({25:'N', 45:'M'})

In [166]:
df

      a   b   c    d
第1天  25  89  19    N
第2天  45  56  46    M
第3天  65  89  49  NaN
第4天  89  17  79  NaN

#### encode strings as integer values (automatically starts at 0)

In [167]:
df['d'] = df.d.factorize()[0]

In [168]:
df

      a   b   c  d
第1天  25  89  19  0
第2天  45  56  46  1
第3天  65  89  49 -1
第4天  89  17  79 -1

#### determine unique values in a column

In [169]:
df.a.nunique()

4

#### replace all instances of a value in a column (must match entire value)

In [170]:
df.a.replace(25, 'new', inplace=True)
df

       a   b   c  d
第1天  new  89  19  0
第2天   45  56  46  1
第3天   65  89  49 -1
第4天   89  17  79 -1

#### transpose data frame (i.e. rows become columns, columns become rows)

In [171]:
df.T

   第1天 第2天 第3天 第4天
a  new  45  65  89
b   89  56  89  17
c   19  46  49  79
d    0   1  -1  -1

In [174]:
df

       a   b   c  d
第1天  new  89  19  0
第2天   45  56  46  1
第3天   65  89  49 -1
第4天   89  17  79 -1

#### string methods are accessed via ‘str’

In [175]:
df.a.str.upper()

第1天    NEW
第2天    NaN
第3天    NaN
第4天    NaN
Name: a, dtype: object

#### converts to uppercase

In [181]:
df

       a   b   c  d
第1天  new  89  19  0
第2天   45  56  46  1
第3天   65  89  49 -1
第4天   89  17  79 -1

In [180]:
df.a.str.contains('new', na='test') 
# checks for a substring, returns boolean series

第1天    True
第2天    test
第3天    test
第4天    test
Name: a, dtype: object

In [182]:
df

       a   b   c  d
第1天  new  89  19  0
第2天   45  56  46  1
第3天   65  89  49 -1
第4天   89  17  79 -1

#### sort a column by its index

In [187]:
df.b.value_counts()

89    2
56    1
17    1
Name: b, dtype: int64

In [186]:
df.b.value_counts().sort_index()

17    1
56    1
89    2
Name: b, dtype: int64

#### change the data type of a column

In [189]:
df['f'] = df.b.astype('float')
df

       a   b   c     d     f
第1天  new  89  19  89.0  89.0
第2天   45  56  46  56.0  56.0
第3天   65  89  49  89.0  89.0
第4天   89  17  79  17.0  17.0

#### Loop through rows in a DataFrame

In [190]:
# Loop through rows in a DataFrame
for index, row in df.iterrows():
    print(index, row['a'])

第1天 new
第2天 45
第3天 65
第4天 89

In [191]:
# Much faster way to loop through DataFrame rows if you can work with tuples
for row in df.itertuples():
    print(row)

Pandas(Index='第1天', a='new', b=89, c=19, d=89.0, f=89.0)
Pandas(Index='第2天', a=45, b=56, c=46, d=56.0, f=56.0)
Pandas(Index='第3天', a=65, b=89, c=49, d=89.0, f=89.0)
Pandas(Index='第4天', a=89, b=17, c=79, d=17.0, f=17.0)

#### Get rid of non-numeric values throughout a DataFrame

In [192]:
for col in df.columns.values:
    df[col] = df[col].replace(‘[⁰-9]+.-’, ‘’, regex=True)

SyntaxError: invalid character '‘' (U+2018) (426773347.py, line 2)

#### Change all NaNs to None (useful before loading to a db)

In [126]:
df = df.where((pd.notnull(df)), None)

#### Split delimited values in a DataFrame column into two new columns

In [127]:
df[‘new_col1’], df[‘new_col2’] = zip(*df[‘original_col’].apply(lambda x: x.split(‘: ‘, 1)))

SyntaxError: invalid character in identifier (<ipython-input-127-6d235790ede6>, line 1)

#### Collapse hierarchical column indexes

In [128]:
df.columns = df.columns.get_level_values(0)

#### change a Series to the ‘category’ data type (reduces memory usage and increases performance)

In [129]:
df[‘column_y’] = df.column_y.astype(‘category’)

SyntaxError: invalid character in identifier (<ipython-input-129-e061185edb5f>, line 1)

#### temporarily define a new column as a function of existing columns

In [130]:
df.assign(new_column = df.column_x + df.spirit + df.column_y)

AttributeError: 'DataFrame' object has no attribute 'column_x'

## If you like this kernel, please give it an upvote. Thank you! :)